---
kind: property
id: P:Autodesk.Revit.DB.ConnectionValidationWarning.Reason
source: html/7a23ef48-fb9b-17e8-e7b7-a714b3e098e4.htm
---
# Autodesk.Revit.DB.ConnectionValidationWarning.Reason Property

Enumeration for reason of warning.

## Syntax (C#)
```csharp
public ConnectionWarning Reason { get; }
```